src/InformationRegisters/ФилиалыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФилиалыТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ФилиалыТорговыхТочек/Ext/RecordSetModule.bsl
Перем ЗарегистрироватьКОбмену;

Процедура ПередЗаписью(Отказ, Замещение)
	ЗарегистрироватьКОбмену = Ложь;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ФилиалыТорговыхТочек.ТорговаяТочка,
	|	ФилиалыТорговыхТочек.Филиал
	|ИЗ
	|	РегистрСведений.ФилиалыТорговыхТочек КАК ФилиалыТорговыхТочек
	|ГДЕ
	|	ФилиалыТорговыхТочек.ТорговаяТочка = &ТорговаяТочка
	|	И ФилиалыТорговыхТочек.Филиал = &Филиал"
	);
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запрос.УстановитьПараметр("ТорговаяТочка", Запись.ТорговаяТочка);
		Запрос.УстановитьПараметр("Филиал", Запись.Филиал);
	
		Если Запрос.Выполнить().Выгрузить().Количество() = 0 Тогда
			ЗарегистрироватьКОбмену = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ, Замещение)
	Если ЗарегистрироватьКОбмену Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			ОбменДаннымиКлиентСервер.ЗарегистрироватьКОбменуБИТ(Запись.ТорговаяТочка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
